<template>
  <div class="content">
    <h1 class="content__title c">3D Сканирование</h1>
    <div class="content__head c">
      <div class="content__txt">
        <div class="head__txt">
          <p class="txt">
            Наша компания предоставляет услугу 3D-сканирования
            машиностроительных изделий с возможностью выезда на площадки
            заказчиков по Санкт-Петербургу, Москве и другим городам.
          </p>
          <p class="txt-bold bl">
            Мы используем трехмерный сканер в решении задач обратного
            проектирования (реверс инжиниринга) деталей, станков и механизмов по
            образцу
          </p>
          <br />
          <modalForm></modalForm>
        </div>
        <div class="content-img">
          <img src="/src/assets/co-eng.jpg" alt="" />
        </div>
      </div>
      <div class="txt-bold mt">
        3D сканер работает по принципу получения цифровой трехмерной копии
        (облака точек) объекта.
        <br />
        <br />
        Это актуально в задачах прототипирования, изготовления деталей по
        образцу и восстановления геометрии изношенных узлов устройств.
        Необходимость 3D сканирования возникает в случае, когда объект имеет
        сложную конфигурацию или криволинейные области. В зависимости от задачи
        мы используем оптические или лазерные 3D сканеры.
        <br />
        <br />
        Использование 3D-сканеров относится к бесконтактным методам измерения.
        3D-сканер определяет параметры физических предметов с помощью
        структурированного света (оптические сканеры), лазера (лазерные сканеры)
        за счёт считывания информации камерами или датч иками о расстоянии до
        изделия и скорости отражения лучей от его поверхности. У нас
        используются, в том числе, гибридные сканеры, которые совмещают в себе
        обе технологии (лазерную и оптическую). Это оборудование позволяет
        создавать в системе координат образ любого реального предмета, в том
        числе крупного или, наоборот, мелкого. А также быстро получать сведения
        о размерах для целей инжиниринга с достаточно высоким качеством, что
        является существенным преимуществом перед замерами ручными
        инструментами.
        <br />
        <br />
        Мы пользуемся специальным программным обеспечением для моделирования
        сканируемых объектов.
        <br />
        <br />
        К каждому заказу подходим со всей ответственностью и находим лучшие
        решения!
      </div>
    </div>
    <div class="content-midle c">
      <h1>Порядок действия при 3D-сканировании:</h1>
      <div class="mt">
        <ul class="list">
          <li>
            <h5>Предоставить деталь в чистом виде</h5>
            <p class="txt">
              Предоставить образец для сканирования необходимо, демонтировав
              крепеж и, удалив, следы масел, герметиков, ржавчины и др.
              загрязнений. Желательно приложить ответные части. Перед отправкой
              образца согласовать дату доставки с менеджером.
            </p>
          </li>
          <li>
            <h5>Подготовка объекта сканирования к работе</h5>
            <p class="txt">
              При необходимости, на объект сканирования наносится матирующий
              спрей при оптическом 3D сканировании. Это касается чёрных,
              блестящих и прозрачных поверхностей. После сканирования объекта
              спрей можно легко смыть. Также для позиционирования в пространстве
              и дальнейшей сшивки сканов при обработке, наносятся метки в виде
              наклеек или магнитные маркеры.
            </p>
          </li>
          <li>
            <h5>Трёхмерные полигональные модели</h5>
            <p class="txt">
              Обработка материалов 3D сканирования (сшивка, очистка от "мусора"
              и т.п.) с получением результата в виде облака точек (трехмерных
              копий в формате stl, obj и т.д.). Материал, полученный на третьем
              этапе может использоваться для 3D печати или работы в дизайнерской
              среде.
            </p>
          </li>
          <li>
            <h5>Трёхмерные твердотельные модели</h5>
            <p class="txt">
              Перевод в формат, позволяющий вносить изменения в конфигурацию
              объекта, а также выпускать чертежи. По согласованию или исходя из
              задачи, в 3D образе реализуется дерево построения с целью
              обеспечения возможности работы с отдельными элементами.
            </p>
          </li>
          <li>
            <h5>Разработка чертежа изделия</h5>
            <p class="txt">
              Затем на последнем этапе осуществляется построение и выпуск машиностроительных чертежей для производства с оформлением согласно требованиям ЕСКД и учетом технологии изготовления и применяемого оборудования. Необходимость разработки чертежей определяется конечной задачей. Статьи с информацией о правилах оформления чертежей расположены в разделе.
            </p>
          </li>
        </ul>
      </div>
      <div class="mt">
        <h3>Также могут быть включены:</h3>
        <ul class="list">
          <li>Инженерные расчеты</li>
          <li>
            Чертеж общего вида или габаритный для сертификации или презентации
          </li>
          <li>Электромонтажный</li>
          <li>Монтажный</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup>
import modalForm from "../modalForm.vue";
</script>

<style lang="scss" scoped>

.txt {
  font-size: 16px;
}
li{
  margin-top: 20px;
}
h3{
  margin-bottom: 10px;
}
h5{
  margin-bottom: 10px;
}
.content {
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 50px;
  gap: 50px;
}
.c {
  width: 80%;
}
.head__txt {
  width: 100%;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    width: 50%;
    height: 50%;
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
@media (min-width: 200px) and (max-width: 800px) {
  .content__txt {
    flex-direction: column-reverse;

    .content-img {
      width: 100%;
      height: 100%;
      box-shadow: 0 0 8px rgb(0, 0, 0);
    }
  }
}
@media (min-width: 200px) and (max-width: 500px) {
  p{
    font-size: 12px;
  }
  li{
    font-size: 12px;
  }
  .txt {
    font-size: 12px;
  }
  .txt-bold {
    font-size: 15px;
  }
}
</style>
