<template>
  <div class="content">
    <h1 class="content__title c">Оцифровка чертежей</h1>
    <div class="content__head c">
      <div class="content__txt">
        <div class="head__txt">
          <p class="txt">
            Оцифровка чертежей и технической документации позволяет не потерять
            и/или восстановить архивы документов, выпущенных в бумажном виде.
            Это решение поможет сохранить наработанные документы и опыт
            предыдущих поколений. Создание электронных копий позволит иметь
            возможность использовать материалы в работе конструкторов.
          </p>
          <p class="txt-bold bl">
            Векторизация и оцифровка — это способы перевода чертежей в
            электронный вид с применением современного программного обеспечения
            (ПО).
          </p>
          <br />
          <modalForm></modalForm>
        </div>
        <div class="content-img">
          <img src="/src/assets/co-eng.jpg" alt="" />
        </div>
      </div>
    </div>
    <div class="content-midle c">
      <h1>Детали выполнения услуг:</h1>
      <div class="mt">
        <h2>
          Современное проектирование оборудования уже не нуждается в схемах,
          разработанных вручную на бумаге. Однако перевод архивных чертежей
          инженеров-конструкторов актуален и по сей день.
        </h2>
        <ul class="list">
          <li>
            <h5>Оцифровка чертежей и схем</h5>
            <p class="txt">
              Пожалуй, самый простой механизм. Оцифровка применяется, когда
              чертежи читаемы и находятся в полной сохранности. В этом случае
              оригиналы переводятся в электронный вид формата pdf или jpg,
              используя сканирование. Чтобы оцифровать чертежи нам потребуются
              исходники в распечатанном виде.
            </p>
          </li>
          <li>
            <h5>Векторизация с помощью отрисовки</h5>
            <p class="txt">
              Сначала мы импортируем электронный вид документов (исходных
              чертежей) в CAD-программу. После этого специалист-конструктор
              обводит контуры графического объекта поверх изображения. К
              отрисовке мы прибегаем, когда после сканирования чертеж не читаем,
              это может быть из-за низкого качества или повреждения исходного
              носителя, сторонних следов, оставшихся на бумаге, выцветания или
              разрыва. Если в архиве процент таких чертежей невысок, то чертежи
              восстанавливаются ручной отрисовкой.
            </p>
          </li>
          <li>
            <h5>Построение</h5>
            <p class="txt">
              Позволяет не только сохранить чертежи, но и дает возможность
              работать с ними в дальнейшем. Работа строится следующим образом:
              <br />
              1. Сначала на основе сканированных или отрисованных чертежей
              строятся 3d-модели объектов.
              <br />
              2. Потом на основании этих моделей строятся чертежи в соответствии
              с исходными чертежами и выполняется оформление чертежей с учётом
              требований Заказчика, например, адаптация к современным стандартам
              ГОСТ. <br />Таким образом, вы получаете цифровой редактируемый
              комплект документации в CAD-программе — 3d-модели, чертежи, в
              которые можете вносить изменения, при необходимости.
            </p>
          </li>
        </ul>
      </div>
      <div class="mt">
        <p class="txt">
          Наиболее правильным считается оцифровка чертежей с построением. В
          таком случае возможна дальнейшая работа с моделями деталей и узлов.
          Это нужно, чтобы вносить конструктивные изменения, если будет
          необходимо изготовление деталей или производство усовершенствованных
          изделий.
          <br />
          Заказать услугу оцифровки чертежей можно, не только имея чертежи на
          бумаге. Также вы можете предоставить кальки и так называемые «синьки».
          Для этого необходимо больше времени, но мы сможем получить требуемый
          результат и выполнить заказ качественно.
          <br />
          Работая с такими исходниками мы можем применить только векторизацию
          построением.
          <br />
          Кроме того, это могут быть отсканированные ранее чертежи в формате:
          pdf, jpg, png и др.
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
import modalForm from "../modalForm.vue";
</script>

<style lang="scss" scoped>

.txt {
  font-size: 16px;
}
li{
  margin-top: 20px;
}
.content {
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 50px;
  gap: 50px;
}
.c {
  width: 80%;
}
h3{
  margin-bottom: 10px;
}
h5{
  margin-bottom: 10px;
}
.head__txt {
  width: 100%;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    width: 50%;
    height: 50%;
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
@media (min-width: 200px) and (max-width: 800px) {
  .content__txt {
    flex-direction: column-reverse;

    .content-img {
      width: 100%;
      height: 100%;
      box-shadow: 0 0 8px rgb(0, 0, 0);
    }
  }
}
@media (min-width: 200px) and (max-width: 500px) {
  p{
    font-size: 12px;
  }
  li{
    font-size: 12px;
  }
  .txt {
    font-size: 12px;
  }
  .txt-bold {
    font-size: 15px;
  }
}
</style>
