<template>
  <div class="content">
    <h1 class="content__title c">Реверс инжиниринг</h1>
    <div class="content__head c">
      <div class="content__txt">
        <div class="head__txt">
          <p class="txt">
            Реверс-инжиниринг — обратное проектирование, обратная разработка.
            Требуется, когда необходимо изготовить аналог или заменить
            изношенные или повреждённые образцы, а новые либо
            сложно/дорого/невозможно достать, либо необходимо изготовить с
            учётом внесения корректировок в изделие.
          </p>
          <p class="txt-bold bl">
            Мы предлагаем комплекс услуг проектирования деталей, узлов и
            технологически сложных элементов и устройств.
          </p>
          <br />
          <modalForm></modalForm>
        </div>
        <div class="content-img">
          <img src="/src/assets/co-eng.jpg" alt="" />
        </div>
      </div>
      <div class="txt-bold mt">
        Промышленность России, безусловно, реагирует на новости и события в
        стране и в мире. В свете этого направление реверс-инжиниринга пользуется
        особой популярностью у наших клиентов.
        <br />
        <br />
        Обратный инжиниринг выполняет роль инструмента для реализации программы
        импортозамещения. Реверс-инжиниринг позволяет не проходить все этапы,
        которые должны быть пройдены при разработке продукта с нуля (эскизное
        проектирование, техническое предложение, проработка и согласование
        нескольких вариантов конструкции, расчёты, доработки и т.п.), а ускорить
        процесс и получить на основе имеющегося образца данные о конструктиве в
        виде КД, и, изготовив, испытав опытный образец, запустить серию.
        <br />
        <br />
        Другими словами, реверс-инжиниринг принято использовать, когда в наличии
        есть изделие и стоит задача получить аналогичный продукт на своём или
        аутсорсинговом производстве. Мы предлагаем конструкторскую поддержку на
        любом этапе.
      </div>
    </div>
    <div class="content-midle c">
      <h1>Список документации</h1>
      <div class="mt">
        <h3>Порядок действий при инжиниринге изделия (этапы):</h3>
        <ul class="list">
          <li>Демонтировать объект</li>
          <li>
            Снять все необходимые размеры для построения цифровых моделей
            деталей и чертежей (образмерить)
          </li>
          <li>Провести лабораторное определение материалов (анализ)</li>
          <li>Построить цифровые модели и чертежи изделия/детали</li>
          <li>
            Изготовить опытный образец изделия, при необходимости из более
            доступных материалов-аналогов
          </li>
          <li>
            Проверить геометрию деталей на месте установки, проверить на
            собираемость и работоспособность составных частей на готовом
            изделии, испытать
          </li>
        </ul>
      </div>
      <div class="mt">
        <p class="list">
          По разработанным цифровым 3D-моделям и чертежам объекты можно изготавливать впоследствии неоднократно. Для массового производства обязателен пункт с изготовлением опытного образца.
          <br>
          <br>
          После согласования стоимости и сроков работ, проведения оплаты объект передаётся нам для проведения замеров и, по возможности, остаётся у нас до конца работы, чтобы сверить все размеры в готовых чертежах и/или моделях с оригиналом деталей.
          <br>
          <br>
          Если необходимо, специалисты нашей компании могут провести замеры изделий на вашем объекте. Для оперативности укажите, пожалуйста, адрес, даты, время в которое можно находиться на объекте, условия прохода.
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
import modalForm from "../modalForm.vue";
</script>

<style lang="scss" scoped>
* {
  color: #fff;
}
.txt {
  font-size: 16px;
}
li{
  margin-top: 20px;
}
h3{
  margin-bottom: 10px;
}
h5{
  margin-bottom: 10px;
}
.content {
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 50px;
  gap: 50px;
}
.c {
  width: 80%;
}
.head__txt {
  width: 100%;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
</style>
