<template>
  <div class="content">
    <h1 class="content__title c">Обработка 3D сканирования</h1>
    <div class="content__head c">
      <div class="content__txt">
        <div class="head__txt">
          <p class="txt">
            Одним из направлений нашей деятельности является твердотельное
            моделирование, в том числе обработка материалов трехмерного
            сканирования до твердотельной 3D модели с деревом построения
          </p>
          <p class="txt-bold bl">
            3Д-модель с деревом построений — это трёхмерная модель, содержащая
            структурированную последовательность выполнения операций.
          </p>
          <br />
          <modalForm></modalForm>
        </div>
        <div class="content-img">
          <img src="/src/assets/co-eng.jpg" alt="" />
        </div>
      </div>
      <div class="txt-bold mt">
        Услуга получения 3D-модели с деревом построения на основе материалов
        трехмерного сканирования востребована при реверс-инжиниринге деталей со
        сложными криволинейными поверхностями (лопасти лопаток, винтов), а также
        изделий сложной конфигурации, измерение которых невозможно ручным
        инструментом.
        <br />
        <br />
        Дерево построения в цифровой 3Д-модели позволяет вносить изменения в
        структуру модели, в отдельные операции построения (менять размеры и
        форму), что позволяет корректировать конструкцию изделия, а также
        строить модели исполнений деталей (типоразмеров).
        <br />
        <br />
        Также такая услуга востребована при использовании 3Д-модели в дальнейшей
        работе для разработки чертежей для производства.
        <br />
        <br />
        В результате сканирования модель представляет из себя полигональную
        цифровую модель (облако точек), которую впоследствии используют в
        специализированной программе для её обработки.
      </div>
    </div>
    <div class="content-midle c">
      <h1>Порядок обработки материалов 3Д-сканирования</h1>
      <div class="mt">
        <ul class="list">
          <li class="txt">
            Первыми этапами обработки являются ориентирование детали в
            пространстве и удаление дефектов сканирования, лишних элементов,
            попавших в объектив и шумов из материалов сканирования
          </li>
          <li class="txt">
            После подготовки модели инженер-конструктор строит параметрическую
            3Д - модель, ориентируясь на контуры полигональной модели,
            полученной на предыдущем этапе. На данном этапе создаётся дерево
            построения модели, если это требуется.
          </li>
          <li class="txt">
            Завершающим этапом является экспорт полученной твердотельной модели
            с деревом построения в CAD программы для дальнейшего использования.
          </li>
        </ul>
        <p class="txt">
          Нам для работы достаточно «сырого скана», то есть сшитой после
          сканирования полигональной 3Д-модели. Артефакты, шумы, дыры, лишние
          элементы со скана можно не убирать, так мы будем строить модель
          заново, ориентируясь на контуры, полученные в модели после
          сканирования.
        </p>
        <br />
      </div>
      <div class="mt">
        <h3>Порядок выполнения работы по обработке материалов сканирования</h3>
        <ul class="list">
          <br>
          <li>
            <h3>Необходимость изготовить деталь по образцу</h3>
            <p class="txt mt-20">
              При наличии изделия, устройства мы готовы создать комплект
              графических и текстовых материалов, по которым возможно
              изготовление, сертификация или решение др. задач.
            </p>
          </li>
          <br>
          <li>
            <h3>Предоставление материалов сканирования</h3>
            <p class="txt mt-20">
              Имеющуюся 3Д-модель необходимо прислать в формате stl или obj
              (облако точек) нам на почту. Указать формат, в котором необходимо
              выдать модель по итогу работы и ответственные размеры с
              посадочными местами.
            </p>
          </li>
          <br>
          <li>
            <h3>Необходимость изготовить деталь по образцу</h3>
            <p class="txt mt-20">
              При наличии изделия, устройства мы готовы создать комплект
              графических и текстовых материалов, по которым возможно
              изготовление, сертификация или решение др. задач.
            </p>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup>
import modalForm from "../modalForm.vue";
</script>

<style lang="scss" scoped>
* {
  color: #fff;
}
li{
  margin-top: 20px;
}
.txt {
  font-size: 16px;
}
.content {
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 50px;
  gap: 50px;
}
.c {
  width: 80%;
}
.head__txt {
  width: 100%;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
.mt-20{
  margin-top: 20px;
}
h3{
  margin-bottom: 10px;
}
h5{
  margin-bottom: 10px;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    width: 50%;
    height: 50%;
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
@media (min-width: 200px) and (max-width: 800px) {
  .content__txt {
    flex-direction: column-reverse;

    .content-img {
      width: 100%;
      height: 100%;
      box-shadow: 0 0 8px rgb(0, 0, 0);
    }
  }
}
@media (min-width: 200px) and (max-width: 500px) {
  p{
    font-size: 12px;
  }
  li{
    font-size: 12px;
  }
  .txt {
    font-size: 12px;
  }
  .txt-bold {
    font-size: 15px;
  }
}
</style>
