<template>
  <div class="content">
    <h1 class="content__title c">Технологическая документация</h1>
    <div class="content__head c">
      <div class="content__txt">
        <div class="head__txt">
          <p class="txt">
            Технологическая документация — совокупность текстовых и графических
            документов, определяющих технологический процесс изготовления
            изделия, предназначенная для организации производственного процесса.
          </p>
          <p class="txt-bold bl">
            У нас вы можете заказать технологическую документацию для любого
            изделия под ваше производство и сдачу документации Военному
            Представительству МО РФ. Технологическая документация (ТД)
            разрабатывается в соответствии с нормами ЕСТД.
          </p>
          <br />
          <modalForm></modalForm>
        </div>
        <div class="content-img">
          <img src="/src/assets/co-eng.jpg" alt="" />
        </div>
      </div>
    </div>
    <div class="content-midle c">
      <h1>Основные документы, входящие в состав ТД:</h1>
      <div class="mt">
        <ul class="list">
          <li>
            <h3>Технологическая инструкция (ТИ)</h3>
            <p class="txt">
              В технологической инструкции описываются технологические процессы,
              методы и приемы, повторяющиеся при изготовлении изделия.
            </p>
          </li>
          <li>
            <h3>Маршрутная карта (МК)</h3>
            <p class="txt">
              В маршрутной карте содержится описание маршрута технологического
              процесса изготовления, включая контроль с указанием данных об
              оборудовании и технологической оснастке.
            </p>
          </li>
          <li>
            <h3>Карта технологического процесса (КТП)</h3>
            <p class="txt">
              Карта технологического контроля описывает изготовление изделия в
              технологической последовательности по всем операциям одного вида
              формообразования, обработки или сборки.
            </p>
          </li>
          <li>
            <h3>Операционная карта (ОК)</h3>
            <p class="txt">
              В операционной карте указываются технологические операции с
              последовательным выполнением переходов.
            </p>
          </li>
          <li>
            <h3>
              В операционной карте указываются технологические операции с
              последовательным выполнением переходов.
            </h3>
            <p class="txt">
              В документе указываются данные о деталях, сборочных единицах и
              материалах, входящих в комплект изделия.
            </p>
          </li>
          <li>
            <h3>Ведомость материалов (ВМ)</h3>
            <p class="txt">
              В ведомости материалов указываются информация о подетальных нормах
              расхода материалов, о заготовках, технологическом маршруте.
            </p>
          </li>
          <li>
            <h3>Ведомость сборки изделия (ВСИ)</h3>
            <p class="txt">
              В документе указываются состав деталей и сборочных единиц,
              необходимых для сборки изделия в порядке входимости, применяемости
              и количества
            </p>
          </li>
          <li>
            <h3>Ведомость технологических документов (ВТД)</h3>
            <p class="txt">
              В ведомости технологических документов указывается полный состав
              документов, необходимых для изготовления изделий.
            </p>
          </li>
        </ul>
        <div class="mt">
          <p class="txt">
            Кроме указанный выше документации, на определенные виды работ
            составляется специализированная документация. <br /><br />
            Технологическая документация на изделие разрабатывается после
            завершения этапа проектирования и утверждения конструкторской
            документации.
          </p>
        </div>
      </div>
      <div class="mt">
        <h1>Порядок разработки Технологической документации:</h1>
        <ul class="list">
          <li>Согласование технического задания (ТЗ). В ТЗ фиксируем список необходимых документов и формат их передачи</li>
          <li>
            Разработка Технологической документации
          </li>
          <li>Сдача документации</li>
        </ul>
      </div>
      <div class="mt">
        <h3>
          Кроме КД мы можем разработать технические, технологические,
          эксплуатационные, ремонтные документы, в том числе:
        </h3>
        <ul class="list">
          <li>Паспорт</li>
          <li>Руководство по эксплуатации</li>
          <li>Инструкцию по сборке</li>
          <li>
            Технические условия и др. сопутствующие изготовлению и поставке
            готовой продукции документы.
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup>
import modalForm from "../modalForm.vue";
</script>

<style lang="scss" scoped>
* {
  color: #fff;
}
.txt {
  font-size: 16px;
}
.content {
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 50px;
  gap: 50px;
}
.c {
  width: 80%;
}
.head__txt {
  width: 100%;
}
.content__txt {
  position: relative;
  display: flex;
  gap: 50px;
  p {
    width: 100%;
  }
  .content-img {
    box-shadow: 0 0 8px rgb(0, 0, 0);
  }
}
.txt-bold {
  margin-top: 50px;
  font-size: 20px;
  padding-left: 15px;
  font-weight: bold;
}
.bl {
  border-left: 2px #ffe70d solid;
}
.mt {
  margin-top: 50px;
}
li{
  margin-top: 20px;
}
h3{
  margin-bottom: 10px;
}
h5{
  margin-bottom: 10px;
}
</style>
