<template>
  <div class="current-page">
    <current-page></current-page>
  </div>  
  <div class="wrap-content">
    <div class="content">
      <div class="wrap-title">
        <div class="y-square"></div>
        <h1>{{ content[route.params.id].title }}</h1>
      </div>
      <h3 v-if="content[route.params.id].subTitle">{{ content[route.params.id].subTitle }}</h3>
      <p v-if="+route.params.id === 0">
        Наша компания выполняет конструкторское проектирование деталей, частей оборудования на заказ под изготовление, сертификацию, презентацию и другие цели наших клиентов.
        <br>
        <br>
        При выполнении работ мы всегда обращаем пристальное внимание на:
        <ol>
              <li>
              <h3>Диалог с заказчиком</h3>
              <br>
              На первом этапе нам важно понять конечную цель разработки и имеющиеся требования к объекту проектирования, поэтому важно совместно согласовать все пункты технического задания с Вами.</li>
            <hr>
              <li>
              <h3>Сроки</h3>
              <br>
              Мы назначаем оптимальные сроки, которые позволяют выполнить поставленные задачи с учётом оптимальной загрузки конструкторов, перепроверить и провести контроль выполненной работы. Если ваша задача имеет жёсткие (сжатые) дедлайны просим обозначить их на этапе обсуждения проекта. Мы организуем работу так, чтобы уложиться в них.</li>
              <hr>
              <li>
              <h3>Точность</h3>
              <br>
              При реверс-инжиниринге на точность влияет ряд факторов: конфигурация и габариты объекта, метод образмеривания (3D сканирование, замер ручным инструментом), изношенность и чистота измеряемого образца. В среднем она составляет от 20 до 500 микрон.</li>
              <hr>
              <li>
              <h3>Стоимость</h3>
              <br>
              Зависит от времени, затрачиваемого на разработку, необходимости выезда конструктора, сложности конструкции, количества вариантов проработки. Каждый проект мы оцениваем индивидуально.</li>
              <hr>
        </ol>
      </p>
      <p v-if="+route.params.id === 1">
        На предприятии "Первый завод", реализующем стратегические цели в сфере производства и реализации электротехнических изделий, высоким приоритетом является обеспечение охраны здоровья и безопасности труда. В связи с этим, на предприятии функционирует служба охраны труда.
        <br>
        <br>
        Принципы охраны труда на "Первом заводе":
        
        <ul>
            <li>Соблюдение законодательства в каждой сфере деятельности предприятия и соответствие принципам Международной Организации Труда;</li>
            <li>Интеграция принципов охраны здоровья и безопасности труда в промышленный подход компании, включая технические, управленческие и финансовые аспекты. Служба охраны труда оказывает поддержку и консультации руководству, а также вовлекает персонал всех уровней предприятия в совершенствование системы охраны труда;</li>
            <li>Приоритетность жизни и здоровья работников над производственными результатами;</li>
            <li>Предупреждение и ликвидация последствий аварий;</li>
            <li>Открытость и доступность информации о мерах по охране здоровья и безопасности труда;</li>
            <li>Постоянное совершенствование системы менеджмента охраны здоровья и безопасности труда;</li>
            <li>Применение комплекса профилактических мер для предотвращения производственных травм и сохранения здоровья работников;</li>
            <li>Управление рисками как важнейший элемент устойчивого развития предприятия.</li>
        </ul>
      </p>
      <p v-if="+route.params.id === 2">
        Если Вам стало известно о совершении (приготовлении) коррупционных правонарушений или каких - либо действий, нарушающих имущественные и иные права и законные интересы  Штамповочного завода "Первый завод", Вы можете сообщить об этом, воспользовавшись специализированными каналами связи, включающими:
        <ul>
            <li>электронную почту ****@*****</li>
            <li>телефон 8 (800) 555-35-35 </li>
            <li>для почтовых отправлений: , Россия, Санкт - Петербург, Лиговский пр-кт, 52 лит О, Заместителю директора по безопасности "Первый завод". </li>
        </ul> 
        Документы:
      </p>
      <p v-if="+route.params.id === 3">
<br>
"В "Первом заводе" мы не только производим качественные изделия, но и активно заботимся о окружающей среде. Мы осознаем важность сохранения природы для будущих поколений, поэтому внедряем передовые технологии и методы, направленные на снижение экологического воздействия наших производственных процессов. Наша компания активно участвует в экологических инициативах, сотрудничает с экологическими организациями и государственными инстанциями для поиска оптимальных решений по минимизации выбросов и улучшению состояния окружающей среды.
<br>
<br>
Мы стремимся к устойчивому развитию, придерживаясь высоких стандартов экологической ответственности и социального вклада. Наша цель - не только процветание бизнеса, но и создание здоровой и безопасной среды для всех. Мы работаем над улучшением нашей экологической производственной деятельности, чтобы оставить мир чище и зеленее для будущих поколений."
      </p>
    </div>
  </div>
</template>

<script setup>
import currentPage from "./currentPage.vue";
import { ref } from "vue";
import { useRoute } from "vue-router";

const route = useRoute();

const content = ref([
  {
    title: "Конструкторское бюро",
    desc: "Наша компания выполняет конструкторское проектирование деталей, частей оборудования на заказ под изготовление, сертификацию, презентацию и другие цели наших клиентов",
    subTitle: "Принципы работы конструкторского бюро",
  },
  {
    title: "Охрана труда",
  },
  {
    title: "Противодействеие корупции",
    subTitle: "Обратная связь для сообщений о фактах коррупции",
    desc: '',
  },
  {
    title: "Экология",
    subTitle:
      "Ответственное отношение к использованию природных ресурсов — одна из ключевых составляющих корпоративной социальной ответственности и важный фактор устойчивого развития Компании.",
    desc: "",
  },
]);
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
.current-page{
  margin-top: 20px;
  margin-left: 20px;
}
.wrap-title{
  display: flex;
  align-items: center;
  @include fluid("gap", 10);
}
.y-square{
  @include fluid("width", 20);
  @include fluid("height", 20);
  background: #ffd400;
}
.wrap-content {
    @include fluid("min-height", 711);
    @include fluid("padding", 20);
  display: flex;
  width: 95vw;
  justify-content: center;
}
.content {
    @include fluid("margin-top", 40);
    @include fluid("gap", 15);
    @include fluid("width", 1000);
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  color: white;
  text-align: center;
}
p {
    @include fluid("margin-top", 17);
    @include fluid("font-size", 18);
  text-align: left;
}
ul{
    text-align: left;
}
li{
    @include fluid("margin-top", 6);
    @include fluid("font-size", 20);
}
</style>
