<template>
  <h1 class="content-title">О КОМПАНИИ</h1>
  <div class="content-txt">
    Предприятие полного цикла. Мы производим широкий спектр продукции,
    обеспечиваемый высоким уровнем компетенции сотрудников. Если Вы ищете
    подрядчика для изготовления изделий – Вы пришли по адресу! Мы постоянно
    развиваем и совершенствуем как парк станков, так и спектр выпускаемых
    изделий и компетенций сотрудников. Работаем с 2012 года, находимся в
    Санкт-Петербурге. Просто позвоните нам и пришлите
    рисунок/эскиз/чертеж/фотографию изделия. Мы проведём прочностные расчёты,
    подумаем о технологичности, о рабочих характеристиках, рассчитаем стоимость
    запуска и производства данного изделия. При необходимости, организуем
    фасовку продукции в фирменную упаковку с Вашим логотипом и дизайном. Помимо
    холодной листовой штамповки, мы осуществляем прокат тонких профилей,
    холодную объемную штамповку, сварку больших партий из черных и нержавеющих
    сталей, контактную сварку, сборку изделий, литье пластмасс и тд.
  </div>
</template>

<script setup>
import { useStore } from "vuex";
import { useRouter } from "vue-router";

const router = useRouter();
const store = useStore();

const localMenu =   {
    name: "about",
    title: "О КОМПАНИИ",
    submenu: ["О компании", "Руководство", "Лицензии", "принципы работы"],
  };

  store.commit('uploadMenu', localMenu);


</script>

<style>
.content-title {
  margin-top: 30px;
  text-align: center;
}
.content-txt {
  margin-top: 10px;
  font-size: 20px;
  width: 700px;
}
</style>
