<template>
  <div class="wrap--tab-container">
    <div class="tab-container">
      <div class="tab--list">
        <div
          class="tab-btn"
          v-for="t in tabs"
          :key="t"
          :class="{ activeTab: currentTab.title === t.title }"
          @click="currentTab = t"
        >
          {{ t.title }}
        </div>
      </div>
      <div class="wrap--tab--content">
        <div class="title--content">
          <h1>Работаем с любыми видами метала</h1>
          <span>от алюминия и меди до твердых сплавов</span>
        </div>
        <div class="tab--content">
          <div>
            <img
              v-for="t in tabs"
              :key="t.url"
              :class="{ activeImg: currentTab.title === t.title }"
              class="tab--img"
              :src="`/img/${t.url}.png`"
              :alt="`${t.title}`"
            />
          </div>
          <span>Об услуге:</span>
          <div class="tab--txt">{{ currentTab.description }}</div>
          <br />
          <modal-form></modal-form>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";
import { useStore } from "vuex";
import modalForm from "./modalForm.vue";

const store = useStore();

const tabs = ref([
  {
    isActive: false,
    id: "0",
    title: "Холодная листовая штамповка",
    url: "Холодная листовая штамповка",
    description:
      "Это вид обработки металлов давлением, при котором листовой материал деформируется в холодном или подогретом состоянии. Этот метод позволяет создавать различные детали и компоненты с высокой точностью и повторяемостью.",
  },
  {
    isActive: false,
    id: "1",
    title: "Лазерная резка",
    url: "Лазерная резка",
    description:
      "Использование лазерного луча для точной и чистой резки различных материалов, включая металлы. Лазерная резка предоставляет возможность создавать сложные формы и контуры, а также выполнять высокоточные операции без необходимости дополнительной обработки.",
  },
  {
    isActive: false,
    id: "2",
    title: "Гибка метала",
    url: "Гибка",
    description:
      "Создание изгибов и форм в металлических изделиях с помощью специализированного оборудования. Гибка метала позволяет создавать различные изделия стребуемыми геометрическими параметрами, такими как углы, радиусы и длины.",
  },
  {
    isActive: false,
    id: "3",
    title: "Слесарные работы",
    url: "Слесарные работы",
    description:
      "Ремонт, обслуживание и изготовление деталей и узлов из различных материалов. Слесарные работы включают в себя механическую обработку деталей, сборку и регулировку механизмов, а также проведение различных видов ремонтных работ",
  },
  {
    isActive: false,
    id: "4",
    title: "Изготовление и ремонт фильер",
    url: "Фильера",
    description:
      "Включает в себя процесс создания и восстановления специальных высокопрочных форм, таких как пластины или колпачки с тарированными отверстиями, расположенными в определенном порядке.",
  },
  {
    isActive: false,
    id: "5",
    title: "Фрезерная гравировка с ЧПУ",
    url: "Фрезерная гравировка",
    description:
      "Использование компьютерно-управляемого фрезерного станка для создания точных гравировок и вырезания на различных материалах. Этот метод позволяет создавать сложные узоры, тексты и рисунки на поверхностях металла, дерева, пластика и других материалов.",
  },
  {
    isActive: false,
    id: "6",
    title: "Токарно-фрезерные работы",
    url: "Фрезеные работы",
    description:
      "Комбинирование операций токарной и фрезерной обработки для создания сложных деталей и изделий из металла. Токарно-фрезерные работы позволяют выполнять различные операции обработки, такие как нарезание резьбы, создание отверстий, фрезерование контуров и т.д.",
  },
  {
    isActive: false,
    id: "7",
    title: "Виброгалтовка",
    url: "Виброгалтовка",
    description:
      "Применение специализированного оборудования для доводки и отделки поверхностей вибрационным методом. Виброгальтовка позволяет удалить остаточные материалы, сгладить поверхность и придать ей требуемую шероховатость.",
  },
  {
    isActive: false,
    id: "8",
    title: "Электроэррозия",
    url: "Электроэррозия",
    description:
      "Процесс удаления материала с помощью электрической искры между электродом и обрабатываемым предметом. Электроэрозия позволяет выполнить точную и узкую обработку деталей с высокой степенью детализации.",
  },
  {
    isActive: false,
    id: "9",
    title: "Ленточнопильная резка металла",
    url: "Ленточнопильная резка металла",
    description:
      "Использование ленточной пилы для создания прямых или криволинейных резов в металле. Ленточнопильная резка обеспечивает быстрое и точное разделение металлических листов, профилей и труб на требуемые размеры.",
  },
  {
    isActive: false,
    id: "10",
    title: "Гальваническое покрытие",
    url: "Гальваническое покрытие",
    description:
      "Нанесение защитного или декоративного покрытия на металлические поверхности с использованием электрохимического процесса. Гальваническое покрытие позволяет улучшить внешний вид изделий, увеличить их стойкость к коррозии и износу, а также обеспечить лучшую проводимость электрического тока.",
  },
  {
    isActive: false,
    id: "11",
    title: "Покраска",
    url: "Покраска",
    description:
      "Нанесение красочного покрытия на металлические поверхности для защиты от коррозии или создания эстетического вида. Покраска позволяет улучшить защитные свойства металла, придать ему желаемый цвет или текстуру, а также сделать изделия более привлекательными для конечных потребителей.             ",
  },
  {
    isActive: false,
    id: "12",
    title: "Термообработка",
    url: "Термообработка",
    description:
      "Использование тепла для изменения физических свойств металлических изделий, таких как прочность и твердость. Термообработка позволяет достичь требуемой механической характеристики материала, а также устранить внутренние напряжения и дефекты.",
  },
  {
    isActive: false,
    id: "13",
    title: "Накатка резьбы",
    url: "Накатка резьбы",
    description:
      "Процесс создания резьбы на металлической поверхности с помощью специализированного инструмента. Накатка резьбы позволяет создавать резьбовые соединения с высокой точностью и повторяемостью, обеспечивая надежность и герметичность соединений.  ",
  },
  {
    isActive: false,
    id: "14",
    title: "Формовка",
    url: "Формовка",
    description:
      "Создание трехмерных форм или изделий путем деформации материала. Формовка позволяет создавать сложные конструкции, особенно из пластика и металла, с использованием различных методов, таких как штамповка, прессование, выдавливание и гидроформинг.",
  },
  {
    isActive: false,
    id: "15",
    title: "Вакуумная металлизация",
    url: "Вакуумная металлизация",
    description:
      "Нанесение тонкого металлического покрытия на поверхности различных материалов с использованием вакуумной технологии. Вакуумная метализация позволяет придать изделиям металлический вид, улучшить их защиту от коррозии и повысить электропроводность.",
  },
  {
    isActive: false,
    id: "16",
    title: "Сварка MIG",
    url: "Сварка MIG",
    description:
      "Автоматизированный процесс сварки, где металлический электрод плавится и соединяется с металлом под защитой инертного газа, обеспечивая высокую скорость и эффективность, и более подходит для массового производства.",
  },
  {
    isActive: false,
    id: "17",
    title: "Сварка TIG",
    url: "TIG Сварка",
    description:
      "Метод сварки, использующий дугу между вольфрамовым электродом и свариваемым материалом. Один из главных плюсов TIG-сварки - возможность сварки широкого спектра материалов и тонких деталей, так как процесс обеспечивает более точный и управляемый сварочный шов. В сравнении с MIG-сваркой, TIG-сварка более медленная и требует больше опыта и умения от сварщика. ",
  },
  {
    isActive: false,
    id: "18",
    title: "Точечная сварка",
    url: "точечная сварка",
    description:
      "Это метод сварки, при котором свариваемые материалы соединяются точечными или небольшими линейными точками, создаваемыми электрическим разрядом. Точечная сварка часто используется для сварки листового металла, таких как кузова автомобилей. Отличительной чертой точечной сварки является то, что она использует высокую энергию для быстрого плавления и сварки материалов. В отличие от MIG и TIG-сварки, где электрод непрерывно подается, точечная сварка работает практически мгновенно, что делает ее идеальным выбором для сварки на производственных линиях.",
  },
  {
    isActive: false,
    id: "19",
    title: "Холодная высадка",
    url: "Холодная высадка",
    description:
      "Это вид обработки металлов давлением, при котором листовой материал деформируется в холодном или подогретом состоянии. Этот метод позволяет создавать различные детали и компоненты с высокой точностью и повторяемостью.",
  },
]);

const currentTab = ref(store.state.tabs[0]);
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
.wrap--tab-container {
  display: flex;
  height: 100%;
  justify-content: center;
}
.tab-container {
  background-color: #fff;
  display: flex;
  @include fluid("padding", 20);
  @include fluid("gap", 40);
  @include fluid("margin-top", 40);
  @include fluid("width", 1500);
}
.tab--list {
  display: flex;
  flex-direction: column;
  @include fullFluid("gap", 20);
  position: relative;
  @include fullFluid("margin-top", 50);
}
.tab-btn {
  text-align: center;
  @include fullFluid("font-size", 18);
  @include fullFluid("width", 300);
  border: #8b8b8b 2px solid;
  cursor: pointer;
  transition: all 0.5s ease 0.01s;
}
.activeTab {
  color: #4e70af;
  border: #5d8ce4 2px solid;
}
.tab-btn:hover {
  border: #4e70af 2px solid;
}
.wrap--tab--content {
  @include fullFluid("margin-left", 100);
  display: flex;
  @include fullFluid("gap", 10);
  justify-content: center;
  flex-direction: column;
}
.title--content {
  @include fullFluid("margin-bottom", 30);
}
.tab--content span {
  @include fullFluid("font-size", 16);
}
.tab--txt {
  @include fullFluid("margin-top", 20);
  @include fullFluid("font-size", 18);
  transition: all 0.5s ease 0.01s;
}
@media (min-width: 800px) and (max-width: 1000px) {
}
@media (min-width: 200px) and (max-width: 1000px) {
  .wrap--tab-container {
    padding-top: 30px;
    padding-bottom: 30px;
  }
  .tab-container {
    box-shadow: none;
    background-color: unset;
  }
  .tab--list {
    margin-top: 50px;
  }
  .wrap--tab--content h1 {
    @include fullFluid("font-size", 37);
  }
  .wrap--tab--content span {
    @include fullFluid("font-size", 24);
  }
}
.tab--img {
  display: none;
  @include fluid("width", 924);
  @include fluid("height", 516);
  transition: all 0.5s ease 0.01s;
}
.activeImg{
display: block;
}
</style>
