<template>
  <div class="head">
    <div class="current-page">
      <current-page></current-page>
    </div>
    <h1 class="head-title">Присоединяйся к <br />нашей команде</h1>
    <img
      src="https://static.tildacdn.com/tild3565-3030-4133-b061-363333306334/xtra-07.jpg"
      alt=""
    />
  </div>
  <div class="content">
    <div class="content__item content__head">
      <h1 class="content__title">О заводе:</h1>
      <p class="content__txt">
        «Соржинский завод» — успешное штамповочное предприятие, действует с 1995
        года. Мы производим широкий спектр продукции, обеспечиваемый высоким
        уровнем компетенции сотрудников. Мы растём в любых условиях и
        заинтересованы в привлечении опытных и начинающих специалистов.
      </p>
    </div>
    <div class="content__item content__midle">
      <h1 class="content__title">Наши ценности:</h1>
      <div class="wrap-item">
        <div class="midle__item">
          <h2 class="item__title"> <div class="y-square"></div>Узнаем новое каждый день</h2>
          <p>
            Каждый новый день у нас — повод гордиться тем, что сделано, и
            возможность узнать что-то новое. Мы всегда жаждем новых свершений.
          </p>
        </div>
        <div class="midle__item">
          <h2 class="item__title"> <div class="y-square"></div>Расширяем горизонты</h2>
          <p>
            Мы постоянно развиваем и совершенствуем как парк станков, так и
            спектр выпускаемых изделий и компетенций сотрудников, проводим
            регулярное обучение.
          </p>
        </div>
        <div class="midle__item">
          <h2 class="item__title"> <div class="y-square"></div>Заботимся о сотрудниках</h2>
          <p>
            Мы заботимся о своих коллегах. Каждый человек – активный и ключевой
            игрок в рабочем процессе завода. Наша цель – расти вместе.
          </p>
        </div>
        <div class="midle__item">
          <h2 class="item__title"> <div class="y-square"></div>Поддерживаем репутацию</h2>
          <p>
            Мы – фанаты своего дела, и к созданию каждого продукта прикладываем
            максимум усилий. Выпуская продукцию высочайшего класса, мы
            способствуем повышению качества жизни наших соотечественников.
          </p>
        </div>
      </div>
    </div>
    <div class="content__item content__last">
      <h1 class="content__title">Наши преимущества:</h1>
      <div class="wrap-item">
        <div class="last-item">
          <img src="/src/assets/a1.png" alt="" />
          <p class="item-txt">Работа в <span>потрясающей команде</span></p>
        </div>
        <div class="last-item">
          <img src="/src/assets/a2.png" alt="" />
          <p class="item-txt">
            <span>Высокая зарплата </span>и полный соцпакет
          </p>
        </div>
        <div class="last-item">
          <img src="/src/assets/a3.png" alt="" />
          <p class="item-txt"><span>Гибкий график</span> работы</p>
        </div>
        <div class="last-item">
          <img src="/src/assets/a4.png" alt="" />
          <p class="item-txt"><span>Обучение</span> и развитие сотрудников</p>
        </div>
      </div>
    </div>
    <div class="content__item content__cards">
      <h1 class="content__title">Открытые вакансии:</h1>
      <div class="wrap-item">
        <div class="card">
          <h2 class="card__title">Слесарь-наладчик</h2>
          <h3>Обязанности:</h3>
          <ul>
            <li>
              Качественное изготовление деталей и сборочных единиц в заданные
              сроки
            </li>
            <li>
              Сборка конструкций, узлов и штампов по чертежам Слесарные,
              механосборочные, сборочные, сверлильные
            </li>
            <li>виды работ с использованием ручного и электро инструмента</li>
            <li>Устранение дефектов, обнаруженных при сборке</li>
            <li>Участие в испытании узлов, агрегатов</li>
            <li>Запуск и обслуживание агрегатов и штампов</li>
            <li>Поддержание чистоты на рабочем месте</li>
          </ul>
          <h3>Требования:</h3>
          <ul>
            <li>Навыки пуско-наладочных работ обязательны</li>
            <li>Высшее/средне-профессиональное техническое образование</li>
            <li>Знания механики, пневматики, основ автоматики</li>
            <li>Умение читать чертежи</li>
            <li>
              Практические слесарные навыки работы с ручным и
              электроинструментом (ленточная пила, сверлильный станок,
              шуруповерт, УШМ)
            </li>
            <li>Ответственность,</li>
            <li>Обучаемость,</li>
            <li>Внимательность,</li>
            <li>Высокая скорость и качество исполнения работ</li>
          </ul>
          <h3>Условия:</h3>
          <ul>
            <li>Основное место работы: обслуживание производственных цехов</li>
            <li>Оформление по ТК РФ</li>
          </ul>
          <h3>График работы и условия работы</h3>
          <ul>
            <li>полный день</li>
            <li>частичная занятость</li>
          </ul>
        </div>
        <div class="card">
          <h2 class="card__title">Слесарь-наладчик</h2>
          <h3>Обязанности:</h3>
          <ul>
            <li>
              Качественное изготовление деталей и сборочных единиц в заданные
              сроки
            </li>
            <li>
              Сборка конструкций, узлов и штампов по чертежам Слесарные,
              механосборочные, сборочные, сверлильные
            </li>
            <li>виды работ с использованием ручного и электро инструмента</li>
            <li>Устранение дефектов, обнаруженных при сборке</li>
            <li>Участие в испытании узлов, агрегатов</li>
            <li>Запуск и обслуживание агрегатов и штампов</li>
            <li>Поддержание чистоты на рабочем месте</li>
          </ul>
          <h3>Требования:</h3>
          <ul>
            <li>Навыки пуско-наладочных работ обязательны</li>
            <li>Высшее/средне-профессиональное техническое образование</li>
            <li>Знания механики, пневматики, основ автоматики</li>
            <li>Умение читать чертежи</li>
            <li>
              Практические слесарные навыки работы с ручным и
              электроинструментом (ленточная пила, сверлильный станок,
              шуруповерт, УШМ)
            </li>
            <li>Ответственность,</li>
            <li>Обучаемость,</li>
            <li>Внимательность,</li>
            <li>Высокая скорость и качество исполнения работ</li>
          </ul>
          <h3>Условия:</h3>
          <ul>
            <li>Основное место работы: обслуживание производственных цехов</li>
            <li>Оформление по ТК РФ</li>
          </ul>
          <h3>График работы и условия работы</h3>
          <ul>
            <li>полный день</li>
            <li>частичная занятость</li>
          </ul>
        </div>
        <div class="card">
          <h2 class="card__title">Слесарь-наладчик</h2>
          <h3>Обязанности:</h3>
          <ul>
            <li>
              Качественное изготовление деталей и сборочных единиц в заданные
              сроки
            </li>
            <li>
              Сборка конструкций, узлов и штампов по чертежам Слесарные,
              механосборочные, сборочные, сверлильные
            </li>
            <li>виды работ с использованием ручного и электро инструмента</li>
            <li>Устранение дефектов, обнаруженных при сборке</li>
            <li>Участие в испытании узлов, агрегатов</li>
            <li>Запуск и обслуживание агрегатов и штампов</li>
            <li>Поддержание чистоты на рабочем месте</li>
          </ul>
          <h3>Требования:</h3>
          <ul>
            <li>Навыки пуско-наладочных работ обязательны</li>
            <li>Высшее/средне-профессиональное техническое образование</li>
            <li>Знания механики, пневматики, основ автоматики</li>
            <li>Умение читать чертежи</li>
            <li>
              Практические слесарные навыки работы с ручным и
              электроинструментом (ленточная пила, сверлильный станок,
              шуруповерт, УШМ)
            </li>
            <li>Ответственность,</li>
            <li>Обучаемость,</li>
            <li>Внимательность,</li>
            <li>Высокая скорость и качество исполнения работ</li>
          </ul>
          <h3>Условия:</h3>
          <ul>
            <li>Основное место работы: обслуживание производственных цехов</li>
            <li>Оформление по ТК РФ</li>
          </ul>
          <h3>График работы и условия работы</h3>
          <ul>
            <li>полный день</li>
            <li>частичная занятость</li>
          </ul>
        </div>
        <div class="card">
          <h2 class="card__title">Слесарь-наладчик</h2>
          <h3>Обязанности:</h3>
          <ul>
            <li>
              Качественное изготовление деталей и сборочных единиц в заданные
              сроки
            </li>
            <li>
              Сборка конструкций, узлов и штампов по чертежам Слесарные,
              механосборочные, сборочные, сверлильные
            </li>
            <li>виды работ с использованием ручного и электро инструмента</li>
            <li>Устранение дефектов, обнаруженных при сборке</li>
            <li>Участие в испытании узлов, агрегатов</li>
            <li>Запуск и обслуживание агрегатов и штампов</li>
            <li>Поддержание чистоты на рабочем месте</li>
          </ul>
          <h3>Требования:</h3>
          <ul>
            <li>Навыки пуско-наладочных работ обязательны</li>
            <li>Высшее/средне-профессиональное техническое образование</li>
            <li>Знания механики, пневматики, основ автоматики</li>
            <li>Умение читать чертежи</li>
            <li>
              Практические слесарные навыки работы с ручным и
              электроинструментом (ленточная пила, сверлильный станок,
              шуруповерт, УШМ)
            </li>
            <li>Ответственность,</li>
            <li>Обучаемость,</li>
            <li>Внимательность,</li>
            <li>Высокая скорость и качество исполнения работ</li>
          </ul>
          <h3>Условия:</h3>
          <ul>
            <li>Основное место работы: обслуживание производственных цехов</li>
            <li>Оформление по ТК РФ</li>
          </ul>
          <h3>График работы и условия работы</h3>
          <ul>
            <li>полный день</li>
            <li>частичная занятость</li>
          </ul>
        </div>
      </div>
      <p class="footer-txt">Нет подходящей вакансии? Проявите инициативу, отправляйте резюме на почту:</p>
    </div>
  </div>
</template>

<script setup>
import currentPage from "./currentPage.vue";
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
p,
h1,
h2,
h3,
li {
  color: rgb(245, 245, 245);
}
.head {
  @include fluid("height", 911);
  img {
    filter: brightness(40%);
    width: 96vw;
    height: 100%;
  }
  .head-title {
    font-family: "Roboto", Arial, sans-serif;
    z-index: 2;
    @include fluid("font-size", 72);
    line-height: 1.3;
    text-shadow: rgba(0, 0, 0, 0.3) 0px 2px 20px;
    position: absolute;
    top: 30%;
    left: 20%;
  }
}
.current-page {
  position: absolute;
  z-index: 2;
  @include fluid("top", 840);
  @include fluid("left", 140);
}
.content {
  background: linear-gradient(#121212, #2c2c2c);
  @include fluid("padding", 50);
  @include fluid("width", 1811);
  @include fluid("gap", 300);
  display: flex;
  flex-direction: column;
  align-items: center;
  .content__item {
    @include fluid("width", 1000);
  }
  .content__title {
    @include fluid("font-size", 40);
  }
  .content__txt {
    @include fluid("margin-top", 50);
    @include fluid("font-size", 25);
  }
  .midle__item {
    @include fluid("width", 400);
  }
  .wrap-item {
    @include fluid("margin-top", 80);
    @include fluid("gap", 100);
    display: flex;
    justify-content: space-between;
    flex-wrap: wrap;
  }
  .item__title {
    display: flex;
    align-items: center;
    @include fluid("gap", 10);
    margin-bottom: 30px;
  }
  .last-item {
    display: flex;
    align-items: center;
    @include fluid("width", 400);
    @include fluid("gap", 10);

    img {
      @include fluid("width", 100);
      @include fluid("height", 100);
    }
    p {
      color: #ffffffb4;
      @include fluid("font-size", 20);
    }
    span {
      color: #ffffff;
      font-weight: 900;
    }
  }
}
.card {
    @include fluid("width", 450);
    @include fluid("padding", 20);
    box-shadow: rgba(0, 0, 0, 0.3) 0px 2px 20px;
  .card__title {
    margin-bottom: 10px;
  }
}
.footer-txt{
    @include fluid("margin-top", 80);
    @include fluid("font-size", 20);
}
.y-square {
  @include fluid("width", 20);
  @include fluid("height", 20);
  background: #ffd400;
}
</style>
